run/annular_Couette/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;
R_in        0.065;
R_out       0.090;
H           0.020;


vertices
(
    ($R_in 0  0)               //0
    ($R_out 0 0)                //1
    (0 $R_out 0)                //2
    (0 $R_in  0)                //3

    ($R_in  0 $H)               //4
    ($R_out 0 $H)                 //5
    (0 $R_out $H)                 //6
    (0 $R_in  $H)                //7


    (0.707107 0.707107 1)   //8
    (1.414214 1.414214 1)   //9
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 25 20) simpleGrading (1 1 1)

);

edges
(
    arc 1 2 (#calc "$R_out*cos(3.1415/4)" #calc "$R_out*cos(3.1415/4)" 0)
    arc 0 3 (#calc "$R_in*cos(3.1415/4)"  #calc "$R_in*cos(3.1415/4)"  0)
    arc 5 6 (#calc "$R_out*cos(3.1415/4)" #calc "$R_out*cos(3.1415/4)" $H)
    arc 4 7 (#calc "$R_in*cos(3.1415/4)"  #calc "$R_in*cos(3.1415/4)"  $H)
);

boundary
(
    inner_wall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outer_wall
    {
        type patch;
        faces
        (
          (1 5 6 2)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 1 2 3 )
        );
    }


    top
    {
        type patch;
        faces
        (
            (4 5 6 7)

        );
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
