run/annular_Couette/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.0);

boundaryField
{
    outer_wall
    {
    //    type            fixedValue;
    //    value           uniform (0 0 0);
    //     type            zeroGradient;

        type rotatingWallVelocity;
        origin (0 0 0);
        axis (0 0 1);
        omega 0.15; // Rotational speed in radians/sec
        value uniform (0 0 0);

    }

    inner_wall
    {
       type            fixedValue;
       value           uniform (0 0 0);
        //type            zeroGradient;
    }

    bottom
    {
        type rotatingWallVelocity;
        origin (0 0 0);
        axis (0 0 1);
        omega 0.15; // Rotational speed in radians/sec
        value uniform (0 0 0);
    }

    top
    {
        type            zeroGradient;

    }
}

// ************************************************************************* //
