run/annular_Couette/0/nu_fluid
                                                             /*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nu_fluid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0;

boundaryField
{
       outer_wall
    {
        type            zeroGradient;
    }

    inner_wall
    {
        type            zeroGradient;
    }


    bottom
    {
        type            zeroGradient;
    }

    top
    {
         type            fixedValue;
         value           uniform 0.0;

    }
}

// ************************************************************************* //
