run/annular_Couette/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=$(getApplication)

runApplication blockMesh

runApplication mirrorMesh -dict mirrorMeshDict.x -overwrite
rm log.mirrorMesh
runApplication mirrorMesh -dict mirrorMeshDict.y -overwrite
rm log.mirrorMesh

#------------------------------------------------------------------------------
